Revit 2024 API
RenderingSettings.UsesRegionRendering Property
 The bool value that indicates whether to use region rendering.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool UsesRegionRendering { get; set; }
Visual Basic
Public Property UsesRegionRendering As Boolean
	Get
	Set
Visual C++
public:
property bool UsesRegionRendering {
	bool get ();
	void set (bool value);
}
See Also
RenderingSettings Class
Autodesk.Revit.DB Namespace